#ifndef VECTOR_H
#define VECTOR_H

#include <math.h>

//*************************************************************************************************************************
//Модуль для работы с векторами
//*************************************************************************************************************************
struct SVector//структура вектора
{
 double X;//координаты вектора
 double Y;
 double Z;
};
//*************************************************************************************************************************
//Назначение функции:создание вектора
//Параметры:x,y,z-координаты вектора
//Возвращаемое значение:созданный вектор
//Устанавливаемые значения:нет
//*************************************************************************************************************************
SVector CreateVector(double x,double y,double z);
//*************************************************************************************************************************
//Назначение функции:нормировка вектора
//Параметры:v-вектор, подлежащий нормировке
//Возвращаемое значение:нормированный вектор
//Устанавливаемые значения:нет
//*************************************************************************************************************************
SVector NormalizeVector(SVector v);
//*************************************************************************************************************************
//Назначение функции:превращение вектора в специальный вид
//Параметры:v-вектор, подлежащий превращению
//Возвращаемое значение:новый вектор
//Устанавливаемые значения:нет
//*************************************************************************************************************************
SVector VectorToOrt(SVector v);
//*************************************************************************************************************************
//Назначение функции:возвращение нормы вектора
//Параметры:v-вектор
//Возвращаемое значение:норма вектора
//Устанавливаемые значения:нет
//*************************************************************************************************************************
double GetNormaVector(SVector v);
//*************************************************************************************************************************
//Назначение функции:вычисление векторного произведения
//Параметры:u,v-вектора
//Возвращаемое значение:векторное произведение
//Устанавливаемые значения:нет
//*************************************************************************************************************************
SVector VectorProduct(SVector u,SVector v);
//*************************************************************************************************************************
//Назначение функции:вычисление скалярного произведения двух векторов
//Параметры:u,v-вектора
//Возвращаемое значение:скалярное произведение
//Устанавливаемые значения:нет
//*************************************************************************************************************************
double ScalarProduct(SVector u,SVector v);

#endif
